; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v7 - type_1 ?v2 - type_2)
 	      (pred_1 ?v3 - object ?v2 - type_2)
	      (pred_3 ?v7 - type_1 ?v4 - type_3)
	      (pred_2 ?v7 - type_1 ?v3 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v7 - type_1 ?v8 ?v6 - type_2)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v6)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_4 ?v7 ?v5) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v7 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_3 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v1 ?v4) (pred_4 ?v7 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_3 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_14 obj_08 - type_1
obj_06 obj_05 obj_11 obj_01 - type_3
obj_09 obj_12 obj_04 obj_03 - type_2
obj_02 obj_10 obj_13 obj_07 - object)
(:init
(pred_4 obj_14 obj_03)
(pred_3 obj_14 obj_06)
(pred_3 obj_14 obj_05)
(pred_4 obj_08 obj_03)
(pred_3 obj_08 obj_11)
(pred_3 obj_08 obj_01)
(pred_1 obj_02 obj_04)
(pred_1 obj_10 obj_12)
(pred_1 obj_13 obj_09)
(pred_1 obj_07 obj_04)
)
(:goal
(and
(pred_1 obj_02 obj_09)
(pred_1 obj_10 obj_09)
(pred_1 obj_13 obj_09)
(pred_1 obj_07 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_14 obj_04)))
)
)

; plan
1. (op_2 obj_14 obj_03 obj_12)
   deleted: (pred_4 obj_14 obj_03)
   added: (pred_4 obj_14 obj_12)
   goals met: 1 of 4
2. (op_2 obj_08 obj_03 obj_12)
   deleted: (pred_4 obj_08 obj_03)
   added: (pred_4 obj_08 obj_12)
   goals met: 1 of 4
3. (op_1 obj_14 obj_10 obj_12 obj_05)
   deleted: (pred_1 obj_10 obj_12) (pred_3 obj_14 obj_05)
   added: (pred_2 obj_14 obj_10 obj_05)
   goals met: 1 of 4
4. (op_2 obj_08 obj_12 obj_04)
   deleted: (pred_4 obj_08 obj_12)
   added: (pred_4 obj_08 obj_04)
   goals met: 1 of 4
5. (op_2 obj_14 obj_12 obj_09)
   deleted: (pred_4 obj_14 obj_12)
   added: (pred_4 obj_14 obj_09)
   goals met: 1 of 4
6. (op_1 obj_08 obj_07 obj_04 obj_01)
   deleted: (pred_1 obj_07 obj_04) (pred_3 obj_08 obj_01)
   added: (pred_2 obj_08 obj_07 obj_01)
   goals met: 1 of 4
7. (op_1 obj_08 obj_02 obj_04 obj_11)
   deleted: (pred_1 obj_02 obj_04) (pred_3 obj_08 obj_11)
   added: (pred_2 obj_08 obj_02 obj_11)
   goals met: 1 of 4
8. (op_3 obj_14 obj_10 obj_09 obj_05)
   deleted: (pred_2 obj_14 obj_10 obj_05)
   added: (pred_1 obj_10 obj_09) (pred_3 obj_14 obj_05)
   goals met: 2 of 4
9. (op_2 obj_08 obj_04 obj_12)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_12)
   goals met: 2 of 4
10. (op_3 obj_08 obj_07 obj_12 obj_01)
   deleted: (pred_2 obj_08 obj_07 obj_01)
   added: (pred_1 obj_07 obj_12) (pred_3 obj_08 obj_01)
   goals met: 3 of 4
11. (op_2 obj_08 obj_12 obj_09)
   deleted: (pred_4 obj_08 obj_12)
   added: (pred_4 obj_08 obj_09)
   goals met: 3 of 4
12. (op_3 obj_08 obj_02 obj_09 obj_11)
   deleted: (pred_2 obj_08 obj_02 obj_11)
   added: (pred_1 obj_02 obj_09) (pred_3 obj_08 obj_11)
   goals met: 4 of 4
